STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval.c
/**
  ******************************************************************************
  * @file    stm32u575i_eval.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          push-buttons (User and Tamper)
  *          Joystick
  *          Potentiometer
  *          COM ports
  *          available on STM32U575I_EVAL board(MB1550) from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u575i_eval.h"
#include <stdio.h>
#if (USE_BSP_IO_CLASS > 0)
#include "stm32u575i_eval_io.h"
#endif /* USE_BSP_IO_CLASS */

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32U575I_EVAL
  * @{
  */

/** @defgroup STM32U575I_EVAL_LOW_LEVEL LOW LEVEL
  * @{
  */

/** @defgroup STM32U575I_EVAL_COMMON_Private_Defines STM32U575I_EVAL COMMON Private Defines
  * @{
  */

#if (USE_BSP_POT_FEATURE > 0)
#define POT_ADC_POLL_TIMEOUT 1000
#endif /* USE_BSP_POT_FEATURE */
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_COMMON_Private_Macros STM32U575I_EVAL COMMON Private Macros
  * @{
  */
#if (USE_BSP_POT_FEATURE > 0)
#define POT_CONVERT2PERC(x) (((int32_t)(x) * 100) / 0xFFF)
#endif /* USE_BSP_POT_FEATURE */
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_LOW_LEVEL_Private_TypesDefinitions LOW LEVEL Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_LOW_LEVEL_Private_FunctionPrototypes  LOW LEVEL Private Function Prototypes
  * @{
  */
static void BUTTON_TAMPER_EXTI_Callback(void);
static void BUTTON_USER_EXTI_Callback(void);
#if (USE_BSP_COM_FEATURE > 0)
static void COM_MspInit(UART_HandleTypeDef *huart);
static void COM_MspDeInit(UART_HandleTypeDef *huart);
#endif /* USE_BSP_COM_FEATURE */

#if (USE_BSP_POT_FEATURE > 0)
static void ADC_MspInit(ADC_HandleTypeDef *hadc);
static void ADC_MspDeInit(ADC_HandleTypeDef *hadc);
#endif /* USE_BSP_POT_FEATURE */

#if (USE_BSP_IO_CLASS > 0)
static void JOY1_EXTI_Callback(void);
#endif /* USE_BSP_IO_CLASS */

/**
  * @}
  */
/** @defgroup STM32U575I_EVAL_LOW_LEVEL_Exported_Variables LOW LEVEL Exported Variables
  * @{
  */
EXTI_HandleTypeDef hpb_exti[BUTTON_NBR];
#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COM_NBR];
USART_TypeDef *COM_UART[COM_NBR]   = {COM1_UART, COM2_UART};
#endif /* USE_BSP_COM_FEATURE */

#if (USE_BSP_POT_FEATURE > 0)
ADC_HandleTypeDef hpot_adc[POT_NBR];
#endif /* USE_BSP_POT_FEATURE */
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_LOW_LEVEL_Private_Variables LOW LEVEL Private Variables
  * @{
  */
static GPIO_TypeDef *LED_PORT[LED_NBR] = {LED5_GPIO_PORT,
                                          LED6_GPIO_PORT,
#if (USE_BSP_IO_CLASS > 0)
                                          0,
                                          0
#endif /* USE_BSP_IO_CLASS */
                                         };

static const uint32_t LED_PIN[LED_NBR] = {LED5_PIN,
                                          LED6_PIN,
#if (USE_BSP_IO_CLASS > 0)
                                          LED7_PIN,
                                          LED8_PIN
#endif /* USE_BSP_IO_CLASS */
                                         };

static GPIO_TypeDef *BUTTON_PORT[BUTTON_NBR] = {BUTTON_USER_GPIO_PORT,
                                                BUTTON_TAMPER_GPIO_PORT
                                               };
static const uint16_t BUTTON_PIN[BUTTON_NBR] = {BUTTON_USER_PIN,
                                                BUTTON_TAMPER_PIN
                                               };
static const IRQn_Type BUTTON_IRQn[BUTTON_NBR] = {BUTTON_USER_EXTI_IRQ,
                                                  BUTTON_TAMPER_EXTI_IRQ
                                                 };

#if (USE_COM_LOG > 0)
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif /* USE_COM_LOG */

#if (USE_BSP_COM_FEATURE > 0)
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COM_NBR] = {0};
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* USE_BSP_COM_FEATURE */

#if (USE_BSP_POT_FEATURE > 0)
static ADC_TypeDef      *POT_ADC[POT_NBR] = {POT1_ADC};
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
static uint32_t          IsPotMspCbValid[POT_NBR] = {0U};
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
#endif /* (USE_BSP_POT_FEATURE > 0) */

#if (USE_BSP_IO_CLASS > 0)
static uint8_t           JOY_SEL_PIN[JOY_NBR]     = {JOY1_SEL_PIN};
static uint8_t           JOY_DOWN_PIN[JOY_NBR]    = {JOY1_DOWN_PIN};
static uint8_t           JOY_LEFT_PIN[JOY_NBR]    = {JOY1_LEFT_PIN};
static uint8_t           JOY_RIGHT_PIN[JOY_NBR]   = {JOY1_RIGHT_PIN};
static uint8_t           JOY_UP_PIN[JOY_NBR]      = {JOY1_UP_PIN};
static uint8_t           JOY_ALL_PIN[JOY_NBR]     = {JOY1_ALL_PIN};
static uint8_t           CurrentJoyPins[JOY_NBR]  = {0};
static EXTI_HandleTypeDef hjoy_exti[JOY_NBR];
#endif /* USE_BSP_IO_CLASS */
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_LOW_LEVEL_Exported_Functions LOW LEVEL Exported Functions
  * @{
  */

/**
  * @brief  This method returns the STM32U575I_EVAL BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32U575I_EVAL_BSP_VERSION;
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t *BSP_GetBoardName(void)
{
  return (uint8_t *)STM32U575I_EVAL_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board name string
  */
const uint8_t *BSP_GetBoardID(void)
{
  return (uint8_t *)STM32U575I_EVAL_BSP_BOARD_ID;
}

/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7 only if IO expander is used
  *            @arg  LED8 only if IO expander is used
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t io_init_structure;
#endif /* (USE_BSP_IO_CLASS > 0) */
  GPIO_InitTypeDef  gpio_init_structure;

  if ((Led == LED5) || (Led == LED6))
  {
    /* Enable the GPIO_LED clock */
    if (Led == LED5)
    {
      LED5_GPIO_CLK_ENABLE();
    }
    else
    {
      LED6_GPIO_CLK_ENABLE();
    }

    /* Configure the GPIO_LED pin */
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull = GPIO_PULLDOWN;
    gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio_init_structure.Pin = LED_PIN [Led];
    HAL_GPIO_Init(LED_PORT[Led], &gpio_init_structure);
    HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_PIN_RESET);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)

    io_init_structure.Pin  = LED_PIN[Led];
    io_init_structure.Pull = IO_PULLDOWN;
    io_init_structure.Mode = IO_MODE_OUTPUT_PP;
    /* Initialize IO expander */
    if (BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_NO_INIT;
    }
    else
    {
      if (BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_RESET) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_NO_INIT;
      }
    }
    HAL_Delay(1);
#endif /* (USE_BSP_IO_CLASS > 0) */
  }

  return ret;
}

/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7 only if IO expander is used
  *            @arg  LED8 only if IO expander is used
  * @retval BSP status
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t io_init_structure;
#endif /* (USE_BSP_IO_CLASS > 0) */
  GPIO_InitTypeDef  gpio_init_structure;

  if ((Led == LED5) || (Led == LED6))
  {
    /* Configure the GPIO_LED pin */
    gpio_init_structure.Pin = LED_PIN [Led];
    HAL_GPIO_WritePin(LED_PORT[Led], (uint16_t)LED_PIN[Led], GPIO_PIN_RESET);

    HAL_GPIO_DeInit(LED_PORT[Led], gpio_init_structure.Pin);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
    if (BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_RESET) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_NO_INIT;
    }
    else
    {
      io_init_structure.Pin  = LED_PIN[Led];
      io_init_structure.Pull = IO_PULLDOWN;
      io_init_structure.Mode = IO_MODE_OFF;

      if (BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_NO_INIT;
      }
    }
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Turns selected LED On.
  * @param  Led LED to be set on
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7 only if IO expander is used
  *            @arg  LED8 only if IO expander is used
  * @retval BSP status
  */
int32_t BSP_LED_On(Led_TypeDef Led)
{
  int32_t ret;
  if ((Led == LED5) || (Led == LED6))
  {
    HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_PIN_SET);
    ret = BSP_ERROR_NONE;
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
    ret = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_SET);
#else
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led LED to be set off
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7 only if IO expander is used
  *            @arg  LED8 only if IO expander is used
  * @retval BSP status
  */
int32_t BSP_LED_Off(Led_TypeDef Led)
{
  int32_t ret;
  if ((Led == LED5) || (Led == LED6))
  {
    HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_PIN_RESET);
    ret = BSP_ERROR_NONE;
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
    ret = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_RESET);
#else
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led LED to be toggled
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7 only if IO expander is used
  *            @arg  LED8 only if IO expander is used
  * @retval BSP status
  */
int32_t BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t ret;
  if ((Led == LED5) || (Led == LED6))
  {
    HAL_GPIO_TogglePin(LED_PORT[Led], (uint16_t)LED_PIN[Led]);
    ret = BSP_ERROR_NONE;
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
    ret = BSP_IO_TogglePin(0, LED_PIN[Led]);
#else
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Get the selected LED state.
  * @param  Led LED to be get its state
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7 only if IO expander is used
  *            @arg  LED8 only if IO expander is used
  * @retval LED status
  */
int32_t BSP_LED_GetState(Led_TypeDef Led)
{
  int32_t ret;

  if ((Led == LED5) || (Led == LED6))
  {
    ret = (int32_t)HAL_GPIO_ReadPin(LED_PORT [Led], (uint16_t)LED_PIN [Led]);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
    ret = BSP_IO_ReadPin(0, LED_PIN[Led]);
#else
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }

  return ret;
}

/**
  * @brief  Configures button GPIO and EXTI Line.
  * @param  Button: Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_USER: User Push Button
  *            @arg  BUTTON_TAMPER: Tamper Push Button
  * @param  ButtonMode Button mode
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
  *            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                                    with interrupt generation capability
  * @retval BSP status
  */
int32_t BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpio_init_structure;
  static BSP_EXTI_LineCallback ButtonCallback[BUTTON_NBR] =
  {
    BUTTON_USER_EXTI_Callback,
    BUTTON_TAMPER_EXTI_Callback
  };
  static uint32_t  BSP_BUTTON_PRIO [BUTTON_NBR] =
  {
    BSP_BUTTON_USER_IT_PRIORITY,
    BSP_BUTTON_TAMPER_IT_PRIORITY,
  };
  static const uint32_t BUTTON_EXTI_LINE[BUTTON_NBR] =
  {
    BUTTON_USER_EXTI_LINE,
    BUTTON_TAMPER_EXTI_LINE,
  };
  /* Enable the BUTTON clock*/
  if (Button == BUTTON_TAMPER)
  {
    BUTTON_TAMPER_GPIO_CLK_ENABLE();
  }
  else
  {
    BUTTON_USER_GPIO_CLK_ENABLE();
  }
  gpio_init_structure.Pin = BUTTON_PIN [Button];
  gpio_init_structure.Pull = GPIO_PULLDOWN;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;

