STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval.c
  if (COM >= COM_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register default MspInit/MspDeInit Callback */
    if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID,) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, UART1_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  Register COM Msp Callback registering
  * @param  COM port to be configured.
  * @param  Callbacks pointer to COM MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_COM_RegisterMspCallbacks(COM_TypeDef COM, BSP_COM_Cb_t *Callback)
{
  int32_t ret = BSP_ERROR_NONE;

  if (COM >= COM_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, Callback->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, Callback->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

#if (USE_COM_LOG > 0)
/**
  * @brief  Select the active COM port.
  * @param  COM port to be activated.
  * @retval BSP status
  */
int32_t BSP_COM_SelectLogPort(COM_TypeDef COM)
{
  if (COM_ActiveLogPort != COM)
  {
    COM_ActiveLogPort = COM;
  }
  return BSP_ERROR_NONE;
}

#if defined (__ICCARM__) || defined (__ARMCC_VERSION)
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#elif defined(__GNUC__)
/* With GCC, small printf (option LD Linker->Libraries->Small printf
set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#endif /* __ICCARM__ || __ARMCC_VERSION */

PUTCHAR_PROTOTYPE
{
  (void)HAL_UART_Transmit(&hcom_uart [COM_ActiveLogPort], (uint8_t *) &ch, 1, COM_POLL_TIMEOUT);
  return ch;
}
#endif /* USE_COM_LOG */
#endif /* USE_BSP_COM_FEATURE */

#if (USE_BSP_POT_FEATURE > 0)
/** @addtogroup STM32U575I_EVAL_COMMON_POT_Functions
  * @{
  */

/**
  * @brief  Configure Potentiometer.
  * @param  POT Potentiometer to be configured.
  *          This parameter can be POT1
  * @retval BSP error code
  */
int32_t BSP_POT_Init(POT_TypeDef POT)
{
  int32_t status = BSP_ERROR_NONE;

  /* Initialize POT instance */
  hpot_adc[POT].Instance = POT_ADC[POT];

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
  ADC_MspInit(&hpot_adc[POT]);
#else
  if (IsPotMspCbValid[POT] == 0U)
  {
    /* Register the MSP callbacks */
    if (BSP_POT_RegisterDefaultMspCallbacks(POT) != BSP_ERROR_NONE)
    {
      status = BSP_ERROR_MSP_FAILURE;
    }
  }
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

  if (status == BSP_ERROR_NONE)
  {
    if (MX_ADC1_Init(&hpot_adc[POT]) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return status;
}

/**
  * @brief  DeInitialize Potentiometer.
  * @param  POT Potentiometer to be de_init.
  *          This parameter can be POT1
  * @retval BSP error code
  */
int32_t BSP_POT_DeInit(POT_TypeDef POT)
{
  int32_t status = BSP_ERROR_NONE;

  /* POT de-init */
  hpot_adc[POT].Instance = POT_ADC[POT];
  if (HAL_ADC_DeInit(&hpot_adc[POT]) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
  else
  {
    ADC_MspDeInit(&hpot_adc[POT]);
  }
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

  return status;
}

/**
  * @brief  Get Potentiometer level.
  * @param  POT Potentiometer.
  *          This parameter can be POT1
  * @retval Potentiometer level(0..100%), negative value means error.
  */
int32_t BSP_POT_GetLevel(POT_TypeDef POT)
{
  int32_t  retval = BSP_ERROR_PERIPH_FAILURE;
  uint32_t AdcValue;

  if (HAL_ADC_Start(&hpot_adc[POT]) == HAL_OK)
  {
    if (HAL_ADC_PollForConversion(&hpot_adc[POT], POT_ADC_POLL_TIMEOUT) == HAL_OK)
    {
      AdcValue = HAL_ADC_GetValue(&hpot_adc[POT]);
      retval = POT_CONVERT2PERC(AdcValue);
    }
  }

  return retval;
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register default POT msp callbacks.
  * @param  POT Potentiometer.
  *          This parameter can be POT1
  * @retval BSP status.
  */
int32_t BSP_POT_RegisterDefaultMspCallbacks(POT_TypeDef POT)
{
  int32_t status = BSP_ERROR_NONE;

  /* Register MspInit/MspDeInit callbacks */
  if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPINIT_CB_ID, ADC_MspInit) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPDEINIT_CB_ID, ADC_MspDeInit) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    IsPotMspCbValid[POT] = 1U;
  }
  /* Return BSP status */
  return status;
}

/**
  * @brief  Register BSP POT msp callbacks.
  * @param  POT Potentiometer.
  *          This parameter can be POT1
  * @param  CallBacks Pointer to MspInit/MspDeInit callback functions.
  * @retval BSP status
  */
int32_t BSP_POT_RegisterMspCallbacks(POT_TypeDef POT, BSP_POT_Cb_t *CallBacks)
{
  int32_t status = BSP_ERROR_NONE;

  if (CallBacks == NULL)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit callbacks */
    if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPINIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPDEINIT_CB_ID, CallBacks->pMspDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
  }
  /* Return BSP status */
  return status;
}
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Initialize ADC1.
  * @param  hadc ADC handle.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_ADC1_Init(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef        status = HAL_ERROR;
  ADC_ChannelConfTypeDef   CHANNEL_Config;
  uint32_t                 POT_ADC_CHANNEL[POT_NBR] = {POT1_ADC_CHANNEL};

  /* ADC configuration */
  hadc->Instance                   = POT1_ADC;
  hadc->Init.ClockPrescaler        = ADC_CLOCK_ASYNC_DIV16;
  hadc->Init.Resolution            = ADC_RESOLUTION_12B;
  hadc->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc->Init.ScanConvMode          = ADC_SCAN_DISABLE;
  hadc->Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
  hadc->Init.LowPowerAutoWait      = DISABLE;
  hadc->Init.ContinuousConvMode    = DISABLE;
  hadc->Init.NbrOfConversion       = 1;
  hadc->Init.DiscontinuousConvMode = DISABLE;
  hadc->Init.NbrOfDiscConversion   = 1;
  hadc->Init.ExternalTrigConv      = ADC_SOFTWARE_START;
  hadc->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc->Init.DMAContinuousRequests = DISABLE;
  hadc->Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
  hadc->Init.OversamplingMode      = DISABLE;
  if (HAL_ADC_Init(hadc) == HAL_OK)
  {
    /* ADC channel configuration */
    CHANNEL_Config.Channel      = POT_ADC_CHANNEL[POT1];
    CHANNEL_Config.Rank         = ADC_REGULAR_RANK_1;
    CHANNEL_Config.SamplingTime = ADC_SAMPLETIME_36CYCLES;
    CHANNEL_Config.SingleDiff   = ADC_SINGLE_ENDED;
    CHANNEL_Config.OffsetNumber = ADC_OFFSET_NONE;
    CHANNEL_Config.Offset       = 0;
    if (HAL_ADC_ConfigChannel(hadc, &CHANNEL_Config) == HAL_OK)
    {
      if (HAL_ADCEx_Calibration_Start(hadc, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED) == HAL_OK)
      {
        status = HAL_OK;
      }
    }
  }

