STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval.c
  return status;
}

/**
  * @}
  */
#endif /* (USE_BSP_POT_FEATURE > 0) */

#if (USE_BSP_IO_CLASS > 0)
/**
  * @brief  Configures joystick GPIO and EXTI modes.
  * @param  JOY Joystick to be initialized
  * @param  JoyMode Button mode.
  *          This parameter can be one of the following values:
  *            @arg  JOY_MODE_GPIO: Joystick pins will be used as simple IOs
  *            @arg  JOY_MODE_EXTI: Joystick pins will be connected to EXTI line
  *                                 with interrupt generation capability
  * @param  JoyPins joystick pins to be initialized
  * @retval BSP status
  */
int32_t BSP_JOY_Init(JOY_TypeDef JOY, JOYMode_TypeDef JoyMode, JOYPin_TypeDef JoyPins)
{
  int32_t               status = BSP_ERROR_NONE;
  BSP_IO_Init_t         IO_Init;

  /* Initialize the BSP IO driver and configure the joystick pin */
  switch (JoyPins)
  {
    case JOY_SEL:
      IO_Init.Pin = JOY_SEL_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_SEL_PIN[JOY];
      break;
    case JOY_DOWN:
      IO_Init.Pin = JOY_DOWN_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_DOWN_PIN[JOY];
      break;
    case JOY_LEFT:
      IO_Init.Pin = JOY_LEFT_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_LEFT_PIN[JOY];
      break;
    case JOY_RIGHT:
      IO_Init.Pin = JOY_RIGHT_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_RIGHT_PIN[JOY];
      break;
    case JOY_UP:
      IO_Init.Pin = JOY_UP_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_UP_PIN[JOY];
      break;
    case JOY_ALL:
      IO_Init.Pin = JOY_ALL_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_ALL_PIN[JOY];
      break;
    default :
      status = BSP_ERROR_WRONG_PARAM;
      break;
  }

  if (status == BSP_ERROR_NONE)
  {
    IO_Init.Mode = (JoyMode == JOY_MODE_GPIO) ? IO_MODE_INPUT : IO_MODE_IT_FALLING_EDGE;
    IO_Init.Pull = IO_PULLUP;
    status = BSP_IO_Init(0, &IO_Init);
    if ((status == BSP_ERROR_NONE) && (JoyMode == JOY_MODE_EXTI))
    {
      /* Interrupt already enabled on BSP_IO_Init, just register callback */
      if (HAL_EXTI_GetHandle(&hjoy_exti[JOY], JOY1_EXTI_LINE) == HAL_OK)
      {
        if (HAL_EXTI_RegisterCallback(&hjoy_exti[JOY], HAL_EXTI_RISING_CB_ID, JOY1_EXTI_Callback) != HAL_OK)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
      }
      else
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
    }

  }

  return status;
}

/**
  * @brief  DeInit joystick GPIOs.
  * @param  JOY instance
  * @note   JOY DeInit does not disable the MFX, just set the MFX pins in Off mode
  * @param  JoyPins joystick pins to be de-initialized
  * @retval BSP status
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  int32_t       status = BSP_ERROR_NONE;
  BSP_IO_Init_t IO_Init;

  switch (JoyPins)
  {
    case JOY_SEL:
      IO_Init.Pin = JOY_SEL_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_SEL_PIN[JOY]);
      break;
    case JOY_DOWN:
      IO_Init.Pin = JOY_DOWN_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_DOWN_PIN[JOY]);
      break;
    case JOY_LEFT:
      IO_Init.Pin = JOY_LEFT_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_LEFT_PIN[JOY]);
      break;
    case JOY_RIGHT:
      IO_Init.Pin = JOY_RIGHT_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_RIGHT_PIN[JOY]);
      break;
    case JOY_UP:
      IO_Init.Pin = JOY_UP_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_UP_PIN[JOY]);
      break;
    case JOY_ALL:
      IO_Init.Pin = JOY_ALL_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_ALL_PIN[JOY]);
      break;
    default :
      status = BSP_ERROR_WRONG_PARAM;
      break;
  }
  if (status == BSP_ERROR_NONE)
  {
    IO_Init.Mode = IO_MODE_OFF;
    IO_Init.Pull = IO_NOPULL;
    status = BSP_IO_Init(0, &IO_Init);
  }

  return status;
}

/**
  * @brief  This function handles JOY keys interrupt request.
  * @param  JOY Joystick instance
  * @param  JoyPin Specifies the pin connected EXTI handler
  * @retval None
  */
void BSP_JOY_IRQHandler(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JoyPin);

  HAL_EXTI_IRQHandler(&hjoy_exti[JOY]);
}

/**
  * @brief  BSP Joystick Callback.
  * @param  JOY Joystick instance
  * @param  JoyPin Specifies the pin connected EXTI line
  * @retval None.
  */
__weak void BSP_JOY_Callback(JOY_TypeDef JOY, uint32_t JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JOY);
  UNUSED(JoyPin);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}

/**
  * @brief  Returns the current joystick status.
  * @param  JOY Joystick instance
  * @retval BSP error code if value is negative or one of the following values:
  *            @arg  JOY_NONE
  *            @arg  JOY_SEL
  *            @arg  JOY_DOWN
  *            @arg  JOY_LEFT
  *            @arg  JOY_RIGHT
  *            @arg  JOY_UP
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  int32_t retval = (int32_t)JOY_NONE;
  int32_t status;

  if ((CurrentJoyPins[JOY] & JOY_SEL_PIN[JOY]) == JOY_SEL_PIN[JOY])
  {
    /* Read status of JOY_SEL */
    status = BSP_IO_ReadPin(0, JOY_SEL_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_SEL : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_UP_PIN[JOY]) == JOY_UP_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_UP */
    status = BSP_IO_ReadPin(0, JOY_UP_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_UP : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_DOWN_PIN[JOY]) == JOY_DOWN_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_DOWN */
    status = BSP_IO_ReadPin(0, JOY_DOWN_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_DOWN : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_LEFT_PIN[JOY]) == JOY_LEFT_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_LEFT */
    status = BSP_IO_ReadPin(0, JOY_LEFT_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_LEFT : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_RIGHT_PIN[JOY]) == JOY_RIGHT_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_RIGHT */
    status = BSP_IO_ReadPin(0, JOY_RIGHT_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_RIGHT : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }

  return retval;
}
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_LOW_LEVEL_Private_Functions LOW LEVEL Private Functions
  * @{
  */
/**
  * @brief  Joystick1 EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_EXTI_Callback(void)
{
  int32_t ItStatus;

  if ((CurrentJoyPins[JOY1] & JOY_SEL_PIN[JOY1]) == JOY_SEL_PIN[JOY1])
  {
    /* Read IT status of JOY_SEL */
    ItStatus = BSP_IO_GetIT(0, JOY_SEL_PIN[JOY1]);
    if (ItStatus > 0)
    {
      BSP_JOY_Callback(JOY1, (uint32_t)JOY_SEL);
      /* Clear IT status of JOY_SEL */
      ItStatus = BSP_IO_ClearIT(0, JOY_SEL_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_UP_PIN[JOY1]) == JOY_UP_PIN[JOY1])
  {
    /* Read IT status of JOY_UP */
    ItStatus = BSP_IO_GetIT(0, JOY_UP_PIN[JOY1]);
    if (ItStatus > 0)
    {
      BSP_JOY_Callback(JOY1, (uint32_t)JOY_UP);
      /* Clear IT status of JOY_UP */
      ItStatus = BSP_IO_ClearIT(0, JOY_UP_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_DOWN_PIN[JOY1]) == JOY_DOWN_PIN[JOY1])
  {
    /* Read IT status of JOY_DOWN */
    ItStatus = BSP_IO_GetIT(0, JOY_DOWN_PIN[JOY1]);
    if (ItStatus > 0)
    {
      BSP_JOY_Callback(JOY1, (uint32_t)JOY_DOWN);
      /* Clear IT status of JOY_DOWN */
      ItStatus = BSP_IO_ClearIT(0, JOY_DOWN_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_LEFT_PIN[JOY1]) == JOY_LEFT_PIN[JOY1])
  {
    /* Read IT status of JOY_LEFT */
    ItStatus = BSP_IO_GetIT(0, JOY_LEFT_PIN[JOY1]);
    if (ItStatus > 0)
    {
      BSP_JOY_Callback(JOY1, (uint32_t)JOY_LEFT);
      /* Clear IT status of JOY_LEFT */
      ItStatus = BSP_IO_ClearIT(0, JOY_LEFT_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_RIGHT_PIN[JOY1]) == JOY_RIGHT_PIN[JOY1])
  {
    /* Read IT status of JOY_RIGHT */
    ItStatus = BSP_IO_GetIT(0, JOY_RIGHT_PIN[JOY1]);
    if (ItStatus > 0)
    {
      BSP_JOY_Callback(JOY1, (uint32_t)JOY_RIGHT);
      /* Clear IT status of JOY_RIGHT */
      ItStatus = BSP_IO_ClearIT(0, JOY_RIGHT_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
}
#endif /* USE_BSP_IO_CLASS */

/**
  * @brief  TAMPER EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_TAMPER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_TAMPER);
}

/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER);
}

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Initializes UART MSP.
  * @param  huart UART handle
  * @retval None
  */
static void COM_MspInit(UART_HandleTypeDef *huart)
{
  COM_TypeDef      COM;
  GPIO_InitTypeDef gpio_init_structure;

