STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval.c
  /* Get COM according instance */
  COM = (huart->Instance == COM1_UART) ? COM1 : COM2;

  if (COM == COM1)
  {
    /* Enable GPIO clock */
    COM1_TX_GPIO_CLK_ENABLE();
    COM1_RX_GPIO_CLK_ENABLE();

    /* Enable UART clock */
    COM1_CLK_ENABLE();

    /* Configure UART Tx as alternate function */
    gpio_init_structure.Pin       = COM1_TX_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio_init_structure.Pull      = GPIO_PULLUP;
    gpio_init_structure.Alternate = COM1_TX_AF;
    HAL_GPIO_Init(COM1_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure UART Rx as alternate function */
    gpio_init_structure.Pin       = COM1_RX_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = COM1_RX_AF;
    HAL_GPIO_Init(COM1_RX_GPIO_PORT, &gpio_init_structure);
  }
  else /* COM = COM2 */
  {
    /* Enable VddIO2 for COM2 */
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWREx_EnableVddIO2();
    __HAL_RCC_PWR_CLK_DISABLE();

    /* Enable GPIO clock */
    COM2_TX_GPIO_CLK_ENABLE();
    COM2_RX_GPIO_CLK_ENABLE();

    /* Enable UART clock */
    COM2_CLK_ENABLE();
    __HAL_RCC_LPUART1_FORCE_RESET() ;
    __HAL_RCC_LPUART1_RELEASE_RESET();

    /* Configure UART Tx as alternate function */
    gpio_init_structure.Pin       = COM2_TX_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio_init_structure.Pull      = GPIO_PULLUP;
    gpio_init_structure.Alternate = COM2_TX_AF;
    HAL_GPIO_Init(COM2_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure UART Rx as alternate function */
    gpio_init_structure.Pin       = COM2_RX_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = COM2_RX_AF;
    HAL_GPIO_Init(COM2_RX_GPIO_PORT, &gpio_init_structure);
  }
}

/**
  * @brief  Initialize UART Msp part
  * @param  huart UART handle
  * @retval None
  */
static void COM_MspDeInit(UART_HandleTypeDef *huart)
{
  COM_TypeDef      COM;
  GPIO_InitTypeDef          gpio_init_structure;

  /* Get COM according instance */
  COM = (huart->Instance == COM1_UART) ? COM1 : COM2;

  if (COM == COM1)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM1_TX_PIN;
    HAL_GPIO_DeInit(COM1_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM1_RX_PIN;
    HAL_GPIO_DeInit(COM1_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable UART clock */
    COM1_CLK_DISABLE();
  }
  else /* COM = COM2 */
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM2_TX_PIN;
    HAL_GPIO_DeInit(COM2_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM2_RX_PIN;
    HAL_GPIO_DeInit(COM2_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable UART clock */
    COM2_CLK_DISABLE();
  }
}
#endif /* USE_BSP_COM_FEATURE */

#if (USE_BSP_POT_FEATURE > 0)
/**
  * @brief  Initialize ADC MSP.
  * @param  hadc ADC handle.
  * @retval None.
  */
static void ADC_MspInit(ADC_HandleTypeDef *hadc)
{
  GPIO_InitTypeDef  GPIO_Init;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  /* enable VDDA supply */
  __HAL_RCC_PWR_CLK_ENABLE();
  HAL_PWREx_EnableVddA();

  /* Enable ADC and GPIO clocks */
  POT1_CLK_ENABLE();
  POT1_CHANNEL_GPIO_CLK_ENABLE();

  /* Configure ADC channel pin */
  GPIO_Init.Pin   = POT1_CHANNEL_GPIO_PIN;
  GPIO_Init.Mode  = GPIO_MODE_ANALOG;
  GPIO_Init.Pull  = GPIO_NOPULL;
  GPIO_Init.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(POT1_CHANNEL_GPIO_PORT, &GPIO_Init);
}

/**
  * @brief  Deinitialize ADC MSP.
  * @param  hadc ADC handle.
  * @retval None.
  */
static void ADC_MspDeInit(ADC_HandleTypeDef *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  /* Disable GPIO and POT clock */
  HAL_GPIO_DeInit(POT1_CHANNEL_GPIO_PORT, POT1_CHANNEL_GPIO_PIN);
  POT1_CLK_DISABLE();
}
#endif /* (USE_BSP_POT_FEATURE > 0) */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
